{"documents": ["VIDEO: V 42 - WHO IS ELIGIBLE TO GET TREATMENT AT AFMS HOSPITALS?\nURL: https://youtu.be/4B6rRqp-sVI\n\n=== AUDIO TRANSCRIPT ===\n Hello all, I am Commander Sunthanam from Bangalore, Karnataka, India. In my previous videos, I have covered the facilities which are available to ECHS beneficiaries in case they need to reach a hospital under emergency medical condition or with a referral to a Imperial hospital. In addition to the Imperial Hospital, the options are non-empanied hospital, where you have to pay and then apply for reimbursement and AIFM is military hospitals. However, ECHS beneficiaries are recognized to beneficiaries beyond the ex-servicemen, spouse and children below 25 years. In addition to that, others such as parents, brothers, sisters, etc., are also allowed to be ECHS beneficiaries if they are eligible. In case of AIFM as hospitals, there are certain restrictions in terms of accepting certain category of beneficiaries. AIFM as hospitals recognize for treatment only the veteran, spouse and children below 25 years. Only these ECHS beneficiaries, if they require treatment and admission in AIFM as hospitals, they will be referred by the respective polyclinics to the AIFM as hospitals. All other dependents who are also ECHS beneficiaries such as, as I mentioned, parents, brothers and sisters or persons with disability as for 2016, above the age of 25 years, etc., all these categories of people, if they require specialist consultation or admission for treatment, they wi", "ll be referred by the respective polyclinics directly to the empaneled hospital. They will not be referred to the AIFM as hospitals because AIFM as hospitals will not accept these categories of ECHS beneficiaries. As an important aspect, please note this to avoid unnecessary travel to AIFM as hospitals and then returning to go to empanelasticity. This is the 42nd YouTube video on ECHS services I have launched till date. Do not forget to hit the subscribe button in my YouTube channel, helping hands for ECHS. Jai Hind.\n\n=== VISUAL TEXT FROM SLIDES ===\n\n[At 1.0s]\nV K Santhanam\n", "VIDEO: V 48 -TREATMENT IN AFMS HOSPITALS & 100 % REIMBURSEMENT FOR CERTAIN CATEGORY OF ECHS BENEFICIARIES\nURL: https://youtu.be/G6rslaBvth4\n\n=== AUDIO TRANSCRIPT ===\n Hello all. This video is about important changes to policy pertaining to treatment in AFMS hospital or military hospitals for non-intitled ECHS beneficiaries and reimbursement of the charges. Let me just give you an introduction. Treatment at AFMS hospitals for ECHS beneficiaries since the time ECHS was formed here in 2003. Only the following beneficiaries are eligible for free treatment, namely the veteran or ex-savishman, spouse and dependent children below the age of 25 years. All these three categories will have ECHS cards or their members of the ECHS. As per the policy for this treatment here, the following were not eligible for free treatment. Veterans, brother and sister, PwD to 1, 2, 0, 1, 6 beneficiaries that is disabled as per this particular PwD act to above the age of 25 years and other types of eligible ECHS beneficiaries. That means all these people are ECHS card holders but were not eligible for free treatment at AFMS hospitals. That is military hospitals. The treatment was actually on payment for the bills are raised by service hospitals and these people were ECHS beneficiaries were required to pay. This is called as hospital stoppage role HSR. You have to know only this terminology, nothing over the requirement. In addition to this, till now, whatever payment was made by these people for the tre", "atment at AFMS hospitals, they were not reimbursable at all. A policy was available about a few months back or maybe last year that whenever these people were required to be referred to specialist, polyclinics were to refer above directly to the M-panel hospital so that they do not have to go here and paid and can not get reimbursable. Here it is cashless. So these are the limitations which are there till now. Now with effect from 14th December 2022, this policy has been modified which is ESM friendly changes have been brought into the policy. Let us see what is the changes. ECHS beneficiaries will benefit our now parents, brother and sister and beneficiaries who are covered by PWD Act 2016 above the age of 25 years and other ECHS beneficiaries. Now in order to go and get treatment at a service hospital by these people, referral is not mandatory from the polyclinic. Now in the service hospital charges for the treatment which is called as HSR hospital stoppage rolls and any other charges, these will be paid by the beneficiary before discharge completely. You have to make the payment get the bills from the service hospital. Only by these people please understand ESM spouse and children below 25 years are continue to get free treatment. Now the changes once you have made this payment, that payment is now 100% reimbursable. Till 14th of December this was not reimbursable as we just saw in the previous slide. AFMS hospital on discharge will provide bill with a breakup of charges a", "nd a discharge summary. Beneficiary will submit claim either online or directly by hand to parent polyclinic. The procedure is as equivalent to individual claim which you have been submitting all these years. The next step is the bill processing agency called as BPA will process this claim and reimburs 100% as applicable to the government hospital. In video number 46 of 47, I covered how to get treatment in government hospital by making the payment and getting 100% reimbursable. Now for these people, the treatment in AFMS hospital is completely reimbursable which is a very major beneficiary change which has happened with effect from 14th of December 2022. As I always indicate in other videos, this is a voluntary effort. You can visit my web portal and my youtube channel. This is the 48th video I have launched on ECHS services. I hope you benefit by this. If you like these videos, please click on subscribe button in the youtube channel. Jai Hind.\n\n=== VISUAL TEXT FROM SLIDES ===\n\n[At 1.0s]\nPowerPoint Slide Show - [TREATMENT IN SERVICE HOSP & REIMBURSEMENT OF NON ENTITLED ECHS BENEFICIRIES.pptx] - PowerPoint\nSlide 1 of 5\nHELPING HANDS FOR ECHS\nA VOLUNTEER EFFORT TO HELP VETERANS & FAMILIES ON ECHS ISSUES\nTHIS VIDEO IS ABOUT\nIMPORTANT CHANGES TO POLICY\nTREATMENT IN AFMS HOSPITAL\n&\nREIMBURSEMENT OF CHARGES\nNON ENTITLED ECHS BENEFICIARIES\nO O 2\n0\n", "VIDEO: V 69 - COMPOSITE REFERRAL TO EMPANELLED HOSPITAL FROM POLYCLINIC - ADVSISORY FROM CENTRAL ORGN ECHS\nURL: https://youtu.be/SvY5fO1Zdi4\n\n=== AUDIO TRANSCRIPT ===\n Hello veterans and families, video number 69 from helping hands for ECHS focused on ECHS services. This video is an advisory which is released by Central Organization ECHS which is quite beneficiary friendly. Based on the feedback to Central Organization from various beneficiaries which is the feedback that patients have been referred to an M-panel hospital first for a particular investigation and then a referral for consultation. An referral for treatment and possibly finally a referral for admission. What is the effect of this is the beneficiary or the next of kin of the patient makes multiple trips from residents to polycline at the first instance from that M-panel hospital back to polyclinics and then back to M-panel hospital because of all these possible scenarios. Obviously, this needs to be avoided to the extent feasible. So the advisory from Central Organization is as below. Number one, referrals should be given such that beneficiary is not required to obtain fresh referral for a particular treatment. The exception is unless some other medical problem is discovered later involving a different line of treatment, obviously for that a new referral is required. Number two, using the clinical acumen medical officer at polyclinic must include the relevant actions by the M-panel hospital in the first instance ", "only. This advisory will possibly ensure beneficiaries do not make multiple trips. As you are aware from the 68 videos, this is a volunteer effort by me that is helping hands for ECHS. I have two facilities which are available to help you to know about ECHS services. One is my web portal, the link is given here. The second one is YouTube channel. If you watch my YouTube channel using this link, hit subscribe button. If you use web portal link, the YouTube is also linked or integrated here. In addition, every alternate day or so, you will get important news about ECHS services and policies. Do visit the web portal at least once a day. I am sure you will benefit. Between those two facilities, you will get answers to 99% or more about ECHS. If you still need help, do not hesitate to call my mobile or send me a WhatsApp message. Jai Hind\n\n=== VISUAL TEXT FROM SLIDES ===\n\n[At 1.0s]\nPowerPoint Slide Show - [REFERRAL FROM POLYCLINIC BE COMPLETE TO AVOID MULTIPLE TRIPS BY VETERANS] - PowerPoint\nHELPING HANDS FOR ECHS\nA VOLUNTEER EFFORT TO HELP VETERANS & FAMILIES\nON\nECHS ISSUES\nSlide 1 of 3\nVIDEO # 69\n\"BENEFICIARY FRIENDLY \"\nADVISORY\nFROM CENTRAL ORGN, ECHS\n\"REFERRAL FROM POLYCLINIC TO BE COMPLETE\" TO AVOID MULTIPLE TRIPS BY BENEFICIARIES\nO O\n30\n1\n", "VIDEO: V 3 - EMERGENCY - TREATMENT IN NON EMPANELLED HOSPITAL\nURL: https://youtu.be/wCbVxrf6-7U\n\n=== AUDIO TRANSCRIPT ===\n Hello all. I'm Commander Santana from Bangalore, Karnataka, India. This video is part of the series I'm making on how to manage emergency medical condition being faced by an ECH's beneficiary. There are multiple treatment options available to you. One, go to the nearest Imperial Hospital. Second, go to the nearest non-empanel hospital. The third, go to the nearest literary hospital. These are not given under any priority. You can choose what is best option available to you. Treatment of an emergency by reaching the Imperial Hospital nearest to your home was covered by me in a video published on the 12th of May 2022 in the YouTube. What is an emergency as per easy edges? Any life threatening medical condition is called as an emergency. Few examples of the emergency medical condition are cardio-em agency such as a heart attack. Snake bite is an emergency, dog bite. Any animal bite is an emergency. Neuro-em agencies, kidney failure, acute poisoning, COVID. The list contains about 14 plus categories under life threatening medical condition. If there is any doubt that there is likely to be a loss of life or limb, that condition can be called as an emergency. Under an emergency condition or a life threatening medical condition, the first action is to reach the non-empanel hospital nearest to you. The family or the next of kin should carry easy HS card and a gov", "ernment issued identity card. If possible, carry the past medical records as well. As the treatment commences at the non-empanel hospital as an emergency, the family or the next of kin should obtain a very important document called emergency information report from the hospital. In short, it is called as EAR. This letter signed with all emergency medical conditions, return in that and stamped by the hospital in the letterhead of the hospital. This must be submitted by the family or the next of kin to the polyclinic. This document should also indicate the date and time when the patient was brought inside the hospital. The EAR must be sent to the polyclinic by an email or if possible, it can be handed over to the polyclinic. This action should be completed within 48 hours. The original copy of the EAR should be kept safely by the beneficiary as it is required to be submitted for the reimbursement of the medical expenses. The treatment in a non-empanel hospital is not repeat, not cashless. You must clear the bills and make necessary payment as per the hospital bill prior to the discharge. Once the treatment is completed and the patient is being discharged, ensure that you collect the discharge summary, collect itemized bills for the payment you are made. For example, room rent will be an item. Any lap test will be an item. Any other procedures which have been carried out is an item. What medicines have been provided for which you are making the payment will be an item in the bil", "l. All documents which you collect must be in a hospital letterhead signed and stamped by the hospital. Within 90 days from the discharge, you should be able to submit a reimbursement claim for every payment which you are made. Please note the reimbursement of each item will be limited to CGHS or ECHS rates only. Your claim must have a covering letter and attaching all documents in original. You should complete a contingent bill and sign it. Enclose a copy of the ECHS card. A cancelled bank check along with the other documents. Submit the covering letter along with all documents in original to the polyclinic. Get an acknowledgement of having submitted the claim from the polyclinic in your copy. It is important that you keep a copy of all documents submitted with you so that in case of any queries, you will be able to answer them satisfactorily using these documents. There is a facility available for you to upload the claim online in the ECHS site. However, within 15 days of upload, you should submit the hard copy in original to the polyclinic so that your claim is processed. The polyclinic will generate a claim ID and will be shared with you. You can track the status of the claim online using the claim ID. When the claim is approved, the reimbursement amount will be credited to the bank account. Your provider. Subscribe to this YouTube channel if you like this video and the other videos. This will also help to get notifications about the future videos I am planning to post. P", "lease visit my web portal called Helping Hands for ECHS where you can read step-by-step procedures for every facility offered by ECHS. Call me in my mobile if you need help. You\n\n=== VISUAL TEXT FROM SLIDES ===\n\n[At 1.0s]\nHELPING HANDS FOR ECHS\nA VOLUNTEER EFFORT TO HELP VETERANS & FAMILIES ON ECHS ISSUES\nVIDEO ON\nMEDICAL EMERGENCY\nHOW TO USE NON-EMPANELLED HOSPITAL FACILITIES\nFOR DETAILS VISIT WEB PORTAL\nhttps://echscoregroup.github.io/helping-hands-for-echs/\nFor HELP CALL CDR SANTHANAM @ 97400 72879\n\n[At 11.0s]\nVK Santhanam\n\n[At 521.0s]\nHELPING HANDS FOR ECHS\nCDR SANTHANAM(RETD)\nA VOLUNTEER EFFORT TO HELP VETERANS & FAMILIES ON ECHS ISSUES\nVISIT WEB PORTAL\nhttps://echscoregroup.github.io/helping-hands-for-echs/\nFor HELP CALL 97400 72879\n"], "metadatas": [{"video_id": "4B6rRqp-sVI", "title": "V 42 - WHO IS ELIGIBLE TO GET TREATMENT AT AFMS HOSPITALS?", "url": "https://youtu.be/4B6rRqp-sVI", "chunk_id": 0}, {"video_id": "4B6rRqp-sVI", "title": "V 42 - WHO IS ELIGIBLE TO GET TREATMENT AT AFMS HOSPITALS?", "url": "https://youtu.be/4B6rRqp-sVI", "chunk_id": 1}, {"video_id": "G6rslaBvth4", "title": "V 48 -TREATMENT IN AFMS HOSPITALS & 100 % REIMBURSEMENT FOR CERTAIN CATEGORY OF ECHS BENEFICIARIES", "url": "https://youtu.be/G6rslaBvth4", "chunk_id": 0}, {"video_id": "G6rslaBvth4", "title": "V 48 -TREATMENT IN AFMS HOSPITALS & 100 % REIMBURSEMENT FOR CERTAIN CATEGORY OF ECHS BENEFICIARIES", "url": "https://youtu.be/G6rslaBvth4", "chunk_id": 1}, {"video_id": "G6rslaBvth4", "title": "V 48 -TREATMENT IN AFMS HOSPITALS & 100 % REIMBURSEMENT FOR CERTAIN CATEGORY OF ECHS BENEFICIARIES", "url": "https://youtu.be/G6rslaBvth4", "chunk_id": 2}, {"video_id": "SvY5fO1Zdi4", "title": "V 69 - COMPOSITE REFERRAL TO EMPANELLED HOSPITAL FROM POLYCLINIC - ADVSISORY FROM CENTRAL ORGN ECHS", "url": "https://youtu.be/SvY5fO1Zdi4", "chunk_id": 0}, {"video_id": "SvY5fO1Zdi4", "title": "V 69 - COMPOSITE REFERRAL TO EMPANELLED HOSPITAL FROM POLYCLINIC - ADVSISORY FROM CENTRAL ORGN ECHS", "url": "https://youtu.be/SvY5fO1Zdi4", "chunk_id": 1}, {"video_id": "wCbVxrf6-7U", "title": "V 3 - EMERGENCY - TREATMENT IN NON EMPANELLED HOSPITAL", "url": "https://youtu.be/wCbVxrf6-7U", "chunk_id": 0}, {"video_id": "wCbVxrf6-7U", "title": "V 3 - EMERGENCY - TREATMENT IN NON EMPANELLED HOSPITAL", "url": "https://youtu.be/wCbVxrf6-7U", "chunk_id": 1}, {"video_id": "wCbVxrf6-7U", "title": "V 3 - EMERGENCY - TREATMENT IN NON EMPANELLED HOSPITAL", "url": "https://youtu.be/wCbVxrf6-7U", "chunk_id": 2}, {"video_id": "wCbVxrf6-7U", "title": "V 3 - EMERGENCY - TREATMENT IN NON EMPANELLED HOSPITAL", "url": "https://youtu.be/wCbVxrf6-7U", "chunk_id": 3}]}